; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-7-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-3 - location
	p1-0 - location
	p1-4 - location
	p2-0 - location
	p2-1 - location
	p3-2 - location
	p4-3 - location
	p4-5 - location
	p5-0 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s5)
	(at driver4 s1)
	(at driver5 s0)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at truck7 s5)
	(empty truck7)
	(at package1 s3)
	(at package2 s2)
	(at package3 s0)
	(at package4 s1)
	(at package5 s1)
	(at package6 s4)
	(at package7 s2)
	(at package8 s2)
	(at package9 s3)
	(at package10 s4)
	(at package11 s5)
	(at package12 s1)
	(at package13 s5)
	(at package14 s1)
	(at package15 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 20)
	(= (time-to-walk p0-3 s0) 20)
	(= (time-to-walk s3 p0-3) 8)
	(= (time-to-walk p0-3 s3) 8)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 29)
	(= (time-to-walk p1-0 s1) 29)
	(= (time-to-walk s0 p1-0) 19)
	(= (time-to-walk p1-0 s0) 19)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 56)
	(= (time-to-walk p1-4 s1) 56)
	(= (time-to-walk s4 p1-4) 82)
	(= (time-to-walk p1-4 s4) 82)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 29)
	(= (time-to-walk p2-0 s2) 29)
	(= (time-to-walk s0 p2-0) 89)
	(= (time-to-walk p2-0 s0) 89)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 36)
	(= (time-to-walk p2-1 s2) 36)
	(= (time-to-walk s1 p2-1) 46)
	(= (time-to-walk p2-1 s1) 46)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 55)
	(= (time-to-walk p3-2 s3) 55)
	(= (time-to-walk s2 p3-2) 96)
	(= (time-to-walk p3-2 s2) 96)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 87)
	(= (time-to-walk p4-3 s4) 87)
	(= (time-to-walk s3 p4-3) 34)
	(= (time-to-walk p4-3 s3) 34)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 52)
	(= (time-to-walk p4-5 s4) 52)
	(= (time-to-walk s5 p4-5) 81)
	(= (time-to-walk p4-5 s5) 81)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 27)
	(= (time-to-walk p5-0 s5) 27)
	(= (time-to-walk s0 p5-0) 74)
	(= (time-to-walk p5-0 s0) 74)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 11)
	(= (time-to-drive s1 s0) 11)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 49)
	(= (time-to-drive s4 s0) 49)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 44)
	(= (time-to-drive s5 s0) 44)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 4)
	(= (time-to-drive s2 s1) 4)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 40)
	(= (time-to-drive s0 s2) 40)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 26)
	(= (time-to-drive s5 s2) 26)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 65)
	(= (time-to-drive s2 s3) 65)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 73)
	(= (time-to-drive s2 s4) 73)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 31)
	(= (time-to-drive s5 s4) 31)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 21)
	(= (time-to-drive s1 s5) 21)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 12)
	(= (time-to-drive s3 s5) 12)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s5)
	(at driver3 s1)
	(at driver4 s2)
	(at truck1 s3)
	(at truck2 s4)
	(at truck3 s1)
	(at truck4 s0)
	(at truck5 s0)
	(at package1 s2)
	(at package2 s3)
	(at package3 s4)
	(at package4 s5)
	(at package5 s1)
	(at package6 s2)
	(at package7 s3)
	(at package8 s3)
	(at package9 s3)
	(at package10 s3)
	(at package11 s1)
	(at package12 s4)
	(at package13 s4)
	(at package14 s0)
	(at package15 s1)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 1  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 4 of 24
2. (drive-truck truck1 s1 s0 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (driven) from 0 to 11
   goals met: 4 of 24
3. (walk driver4 s1 p2-1)
   deleted: (at driver4 s1)
   added: (at driver4 p2-1)
   changed: (walked) from 0 to 46
   goals met: 4 of 24
4. (walk driver1 s1 p1-4)
   deleted: (at driver1 s1)
   added: (at driver1 p1-4)
   changed: (walked) from 46 to 102
   goals met: 4 of 24
5. (walk driver4 p2-1 s2)
   deleted: (at driver4 p2-1)
   added: (at driver4 s2)
   changed: (walked) from 102 to 138
   goals met: 5 of 24
6. (load-truck package11 truck7 s5)
   deleted: (at package11 s5)
   added: (in package11 truck7)
   goals met: 5 of 24
7. (load-truck package13 truck7 s5)
   deleted: (at package13 s5)
   added: (in package13 truck7)
   goals met: 5 of 24
8. (board-truck driver3 truck7 s5)
   deleted: (at driver3 s5) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 5 of 24
9. (walk driver1 p1-4 s4)
   deleted: (at driver1 p1-4)
   added: (at driver1 s4)
   changed: (walked) from 138 to 220
   goals met: 6 of 24
10. (load-truck package3 truck1 s0)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   goals met: 6 of 24
11. (board-truck driver5 truck3 s0)
   deleted: (at driver5 s0) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 6 of 24
12. (drive-truck truck1 s0 s5 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   changed: (driven) from 11 to 55
   goals met: 6 of 24
13. (drive-truck truck7 s5 s0 driver3)
   deleted: (at truck7 s5)
   added: (at truck7 s0)
   changed: (driven) from 55 to 99
   goals met: 6 of 24
14. (drive-truck truck1 s5 s3 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 99 to 111
   goals met: 7 of 24
15. (load-truck package1 truck1 s3)
   deleted: (at package1 s3)
   added: (in package1 truck1)
   goals met: 7 of 24
16. (drive-truck truck1 s3 s2 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (driven) from 111 to 176
   goals met: 6 of 24
17. (unload-truck package1 truck1 s2)
   deleted: (in package1 truck1)
   added: (at package1 s2)
   goals met: 7 of 24
18. (load-truck package15 truck1 s2)
   deleted: (at package15 s2)
   added: (in package15 truck1)
   goals met: 7 of 24
19. (drive-truck truck3 s0 s1 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 176 to 187
   goals met: 8 of 24
20. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 8 of 24
21. (load-truck package4 truck3 s1)
   deleted: (at package4 s1)
   added: (in package4 truck3)
   goals met: 8 of 24
22. (load-truck package7 truck1 s2)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   goals met: 8 of 24
23. (drive-truck truck3 s1 s5 driver5)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (driven) from 187 to 208
   goals met: 7 of 24
24. (load-truck package8 truck1 s2)
   deleted: (at package8 s2)
   added: (in package8 truck1)
   goals met: 7 of 24
25. (board-truck driver4 truck2 s2)
   deleted: (at driver4 s2) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 6 of 24
26. (unload-truck package4 truck3 s5)
   deleted: (in package4 truck3)
   added: (at package4 s5)
   goals met: 7 of 24
27. (drive-truck truck3 s5 s1 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (driven) from 208 to 229
   goals met: 8 of 24
28. (load-truck package14 truck3 s1)
   deleted: (at package14 s1)
   added: (in package14 truck3)
   goals met: 8 of 24
29. (drive-truck truck2 s2 s4 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (driven) from 229 to 302
   goals met: 9 of 24
30. (drive-truck truck1 s2 s5 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   changed: (driven) from 302 to 328
   goals met: 9 of 24
31. (load-truck package6 truck2 s4)
   deleted: (at package6 s4)
   added: (in package6 truck2)
   goals met: 9 of 24
32. (drive-truck truck2 s4 s2 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (driven) from 328 to 401
   goals met: 8 of 24
33. (unload-truck package6 truck2 s2)
   deleted: (in package6 truck2)
   added: (at package6 s2)
   goals met: 9 of 24
34. (drive-truck truck2 s2 s4 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (driven) from 401 to 474
   goals met: 10 of 24
35. (drive-truck truck3 s1 s0 driver5)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 474 to 485
   goals met: 9 of 24
36. (unload-truck package14 truck3 s0)
   deleted: (in package14 truck3)
   added: (at package14 s0)
   goals met: 10 of 24
37. (drive-truck truck7 s0 s1 driver3)
   deleted: (at truck7 s0)
   added: (at truck7 s1)
   changed: (driven) from 485 to 496
   goals met: 10 of 24
38. (disembark-truck driver3 truck7 s1)
   deleted: (driving driver3 truck7)
   added: (at driver3 s1) (empty truck7)
   goals met: 11 of 24
39. (drive-truck truck3 s0 s1 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 496 to 507
   goals met: 12 of 24
40. (unload-truck package11 truck7 s1)
   deleted: (in package11 truck7)
   added: (at package11 s1)
   goals met: 13 of 24
41. (load-truck package12 truck3 s1)
   deleted: (at package12 s1)
   added: (in package12 truck3)
   goals met: 13 of 24
42. (unload-truck package13 truck7 s1)
   deleted: (in package13 truck7)
   added: (at package13 s1)
   goals met: 13 of 24
43. (drive-truck truck3 s1 s5 driver5)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (driven) from 507 to 528
   goals met: 12 of 24
44. (drive-truck truck3 s5 s4 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (driven) from 528 to 559
   goals met: 12 of 24
45. (unload-truck package12 truck3 s4)
   deleted: (in package12 truck3)
   added: (at package12 s4)
   goals met: 13 of 24
46. (drive-truck truck2 s4 s2 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (driven) from 559 to 632
   goals met: 12 of 24
47. (drive-truck truck3 s4 s0 driver5)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (driven) from 632 to 681
   goals met: 12 of 24
48. (drive-truck truck3 s0 s1 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 681 to 692
   goals met: 13 of 24
49. (drive-truck truck1 s5 s4 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   changed: (driven) from 692 to 723
   goals met: 13 of 24
50. (load-truck package10 truck1 s4)
   deleted: (at package10 s4)
   added: (in package10 truck1)
   goals met: 13 of 24
51. (unload-truck package3 truck1 s4)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   goals met: 14 of 24
52. (drive-truck truck1 s4 s5 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (driven) from 723 to 754
   goals met: 14 of 24
53. (load-truck package13 truck3 s1)
   deleted: (at package13 s1)
   added: (in package13 truck3)
   goals met: 14 of 24
54. (drive-truck truck3 s1 s5 driver5)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (driven) from 754 to 775
   goals met: 13 of 24
55. (drive-truck truck3 s5 s4 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (driven) from 775 to 806
   goals met: 13 of 24
56. (unload-truck package13 truck3 s4)
   deleted: (in package13 truck3)
   added: (at package13 s4)
   goals met: 14 of 24
57. (drive-truck truck3 s4 s5 driver5)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (driven) from 806 to 837
   goals met: 14 of 24
58. (drive-truck truck1 s5 s3 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 837 to 849
   goals met: 15 of 24
59. (unload-truck package10 truck1 s3)
   deleted: (in package10 truck1)
   added: (at package10 s3)
   goals met: 16 of 24
60. (unload-truck package7 truck1 s3)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   goals met: 17 of 24
61. (unload-truck package8 truck1 s3)
   deleted: (in package8 truck1)
   added: (at package8 s3)
   goals met: 18 of 24
62. (drive-truck truck1 s3 s5 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (driven) from 849 to 861
   goals met: 17 of 24
63. (drive-truck truck1 s5 s1 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (driven) from 861 to 882
   goals met: 17 of 24
64. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 17 of 24
65. (unload-truck package15 truck1 s1)
   deleted: (in package15 truck1)
   added: (at package15 s1)
   goals met: 18 of 24
66. (disembark-truck driver4 truck2 s2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s2) (empty truck2)
   goals met: 19 of 24
67. (drive-truck truck1 s1 s5 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (driven) from 882 to 903
   goals met: 19 of 24
68. (disembark-truck driver2 truck1 s5)
   deleted: (driving driver2 truck1)
   added: (at driver2 s5) (empty truck1)
   goals met: 20 of 24
69. (drive-truck truck3 s5 s3 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (driven) from 903 to 915
   goals met: 20 of 24
70. (load-truck package2 truck7 s1)
   deleted: (at package2 s1)
   added: (in package2 truck7)
   goals met: 20 of 24
71. (board-truck driver3 truck7 s1)
   deleted: (at driver3 s1) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 19 of 24
72. (board-truck driver2 truck1 s5)
   deleted: (at driver2 s5) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 18 of 24
73. (drive-truck truck3 s3 s2 driver5)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (driven) from 915 to 980
   goals met: 18 of 24
74. (drive-truck truck3 s2 s1 driver5)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 980 to 984
   goals met: 19 of 24
75. (drive-truck truck7 s1 s2 driver3)
   deleted: (at truck7 s1)
   added: (at truck7 s2)
   changed: (driven) from 984 to 988
   goals met: 19 of 24
76. (drive-truck truck1 s5 s3 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 988 to 1000
   goals met: 20 of 24
77. (drive-truck truck7 s2 s3 driver3)
   deleted: (at truck7 s2)
   added: (at truck7 s3)
   changed: (driven) from 1000 to 1065
   goals met: 20 of 24
78. (unload-truck package2 truck7 s3)
   deleted: (in package2 truck7)
   added: (at package2 s3)
   goals met: 21 of 24
79. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 21 of 24
80. (drive-truck truck7 s3 s5 driver3)
   deleted: (at truck7 s3)
   added: (at truck7 s5)
   changed: (driven) from 1065 to 1077
   goals met: 21 of 24
81. (disembark-truck driver3 truck7 s5)
   deleted: (driving driver3 truck7)
   added: (at driver3 s5) (empty truck7)
   goals met: 21 of 24
82. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 21 of 24
83. (drive-truck truck1 s3 s5 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   changed: (driven) from 1077 to 1089
   goals met: 20 of 24
84. (board-truck driver4 truck2 s2)
   deleted: (at driver4 s2) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 19 of 24
85. (disembark-truck driver2 truck1 s5)
   deleted: (driving driver2 truck1)
   added: (at driver2 s5) (empty truck1)
   goals met: 20 of 24
86. (board-truck driver3 truck1 s5)
   deleted: (at driver3 s5) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 20 of 24
87. (drive-truck truck1 s5 s1 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (driven) from 1089 to 1110
   goals met: 20 of 24
88. (disembark-truck driver3 truck1 s1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s1) (empty truck1)
   goals met: 21 of 24
89. (disembark-truck driver5 truck3 s1)
   deleted: (driving driver5 truck3)
   added: (at driver5 s1) (empty truck3)
   goals met: 21 of 24
90. (board-truck driver3 truck1 s1)
   deleted: (at driver3 s1) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 20 of 24
91. (drive-truck truck1 s1 s5 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (driven) from 1110 to 1131
   goals met: 20 of 24
92. (drive-truck truck1 s5 s3 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 1131 to 1143
   goals met: 21 of 24
93. (disembark-truck driver3 truck1 s3)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 21 of 24
94. (drive-truck truck2 s2 s4 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (driven) from 1143 to 1216
   goals met: 22 of 24
95. (walk driver3 s3 p3-2)
   deleted: (at driver3 s3)
   added: (at driver3 p3-2)
   changed: (walked) from 220 to 275
   goals met: 22 of 24
96. (walk driver3 p3-2 s2)
   deleted: (at driver3 p3-2)
   added: (at driver3 s2)
   changed: (walked) from 275 to 371
   goals met: 22 of 24
97. (drive-truck truck2 s4 s2 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (driven) from 1216 to 1289
   goals met: 21 of 24
98. (disembark-truck driver4 truck2 s2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s2) (empty truck2)
   goals met: 22 of 24
99. (board-truck driver3 truck2 s2)
   deleted: (at driver3 s2) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 22 of 24
100. (drive-truck truck2 s2 s4 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (driven) from 1289 to 1362
   goals met: 23 of 24
101. (disembark-truck driver3 truck2 s4)
   deleted: (driving driver3 truck2)
   added: (at driver3 s4) (empty truck2)
   goals met: 23 of 24
102. (walk driver3 s4 p1-4)
   deleted: (at driver3 s4)
   added: (at driver3 p1-4)
   changed: (walked) from 371 to 453
   goals met: 23 of 24
103. (walk driver3 p1-4 s1)
   deleted: (at driver3 p1-4)
   added: (at driver3 s1)
   changed: (walked) from 453 to 509
   goals met: 24 of 24
